In [49]:
import pandas as pd
df = pd.read_csv('SP500.csv')
df

           Date  Market Value
0      9/2/1977         97.45
1      9/9/1977         96.37
2     9/16/1977         96.48
3     9/23/1977         95.04
4     9/30/1977         96.53
...         ...           ...
2079   8/4/2017       2476.83
2080  8/11/2017       2441.32
2081  8/18/2017       2425.55
2082  8/25/2017       2443.05
2083  8/29/2017       2446.30

[2084 rows x 2 columns]

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2084 entries, 0 to 2083
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          2084 non-null   object
 1   Market Value  2084 non-null   float64
dtypes: float64(1), object(1)
memory usage: 32.7+ KB

In [51]:
df['Date'][1][1]

'/'

In [52]:
df['Date'][1][-4:]

'1977'

In [53]:
df['Date'][2079][-4:]

'2017'

In [54]:
#Change date to years
for row in range(0,2084):
    df.replace(to_replace=df['Date'][row],value=df['Date'][row][-4:],inplace=True)

df

      Date  Market Value
0     1977         97.45
1     1977         96.37
2     1977         96.48
3     1977         95.04
4     1977         96.53
...    ...           ...
2079  2017       2476.83
2080  2017       2441.32
2081  2017       2425.55
2082  2017       2443.05
2083  2017       2446.30

[2084 rows x 2 columns]

In [55]:
df["Date"][1]

'1977'

In [56]:
#Change to date float
df['Date'] = df['Date'].astype(int)
df

      Date  Market Value
0     1977         97.45
1     1977         96.37
2     1977         96.48
3     1977         95.04
4     1977         96.53
...    ...           ...
2079  2017       2476.83
2080  2017       2441.32
2081  2017       2425.55
2082  2017       2443.05
2083  2017       2446.30

[2084 rows x 2 columns]

In [57]:
df.dtypes

Date              int32
Market Value    float64
dtype: object

In [58]:
import numpy as np

In [59]:
#all years not between 2008-2015 are null
for row in range(0,2084):
    if df['Date'][row] < 2008:
        #df.drop(df.index[row])
        df['Date'] = df['Date'].replace(df['Date'][row], np.nan)
    if df['Date'][row] > 2015:
        #df.drop(df.index[row])
        df['Date'] = df['Date'].replace(df['Date'][row], np.nan)
df

      Date  Market Value
0      NaN         97.45
1      NaN         96.37
2      NaN         96.48
3      NaN         95.04
4      NaN         96.53
...    ...           ...
2079   NaN       2476.83
2080   NaN       2441.32
2081   NaN       2425.55
2082   NaN       2443.05
2083   NaN       2446.30

[2084 rows x 2 columns]

In [60]:
df['Date'][1980]

2015.0

In [61]:
#drop NA
df2=df.dropna()
df2

        Date  Market Value
1583  2008.0       1411.63
1584  2008.0       1401.02
1585  2008.0       1325.19
1586  2008.0       1330.61
1587  2008.0       1395.42
...      ...           ...
1992  2015.0       2091.69
1993  2015.0       2012.37
1994  2015.0       2005.55
1995  2015.0       2060.99
1996  2015.0       2043.94

[414 rows x 2 columns]

In [62]:
df2.dtypes

Date            float64
Market Value    float64
dtype: object

In [63]:
df2['Date'] = df2['Date'].astype(int)
df2

C:\Users\Chris\AppData\Local\Temp/ipykernel_30872/1721071828.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Date'] = df2['Date'].astype(int)

      Date  Market Value
1583  2008       1411.63
1584  2008       1401.02
1585  2008       1325.19
1586  2008       1330.61
1587  2008       1395.42
...    ...           ...
1992  2015       2091.69
1993  2015       2012.37
1994  2015       2005.55
1995  2015       2060.99
1996  2015       2043.94

[414 rows x 2 columns]

In [64]:
#Median Values of SP500 by year
df2.groupby('Date')['Market Value'].agg('median')

Date
2008    1292.780
2009     935.945
2010    1135.680
2011    1277.770
2012    1382.910
2013    1646.490
2014    1933.875
2015    2076.780
Name: Market Value, dtype: float64

In [65]:
df2.columns

Index(['Date', 'Market Value'], dtype='object')

In [66]:
df2 = df2.rename({'Date': 'Year', 'Market Value': 'Market Value'}, axis=1)

In [67]:
df2

      Year  Market Value
1583  2008       1411.63
1584  2008       1401.02
1585  2008       1325.19
1586  2008       1330.61
1587  2008       1395.42
...    ...           ...
1992  2015       2091.69
1993  2015       2012.37
1994  2015       2005.55
1995  2015       2060.99
1996  2015       2043.94

[414 rows x 2 columns]

In [68]:
df2 = df2.rename({'Year': 'Year_SP', 'Market Value': 'Market Value'}, axis=1)
df2

      Year_SP  Market Value
1583     2008       1411.63
1584     2008       1401.02
1585     2008       1325.19
1586     2008       1330.61
1587     2008       1395.42
...       ...           ...
1992     2015       2091.69
1993     2015       2012.37
1994     2015       2005.55
1995     2015       2060.99
1996     2015       2043.94

[414 rows x 2 columns]

In [69]:
#Median Values of SP500 by year
df2 = df2.groupby('Year_SP')['Market Value'].agg('median')
df2

Year_SP
2008    1292.780
2009     935.945
2010    1135.680
2011    1277.770
2012    1382.910
2013    1646.490
2014    1933.875
2015    2076.780
Name: Market Value, dtype: float64

In [71]:
df2.to_csv('SP500TheFinalFinal.csv')